### Forest: Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
[0m[1mmodule.daily_snapshot.data.external.sources_tar: Reading...[0m[0m
[0m[1mmodule.daily_snapshot.data.local_file.init: Reading...[0m[0m
[0m[1mmodule.daily_snapshot.data.local_file.init: Read complete after 0s [id=29cb134137448956f7ab85a89e495939cc65f17b][0m
[0m[1mmodule.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...[0m[0m
[0m[1mmodule.daily_snapshot.data.digitalocean_project.forest_project: Reading...[0m[0m
[0m[1mmodule.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-][0m
[0m[1mmodule.daily_snapshot.data.local_file.sources: Reading...[0m[0m
[0m[1mmodule.daily_snapshot.data.local_file.sources: Read complete after 0s [id=569c3123e7c59dd16f3fa4fe0597e44dfdc2c68b][0m
[0m[1mmodule.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/14512061520513425405][0m
[0m[1mmodule.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=377968175][0m
[0m[1mmodule.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=dfacde1e-cd3f-4b42-8265-b08fa2766567][0m
[0m[1mmodule.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411][0m
[0m[1mmodule.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.daily_snapshot.digitalocean_droplet.forest[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "digitalocean_droplet" "forest" {
      [33m~[0m[0m created_at           = "2023-10-04T13:35:32Z" -> (known after apply)
      [33m~[0m[0m disk                 = 200 -> (known after apply)
      [33m~[0m[0m id                   = "377968175" -> (known after apply)
      [33m~[0m[0m ipv4_address         = "138.197.178.108" -> (known after apply)
      [33m~[0m[0m ipv4_address_private = "10.135.0.5" -> (known after apply)
      [32m+[0m[0m ipv6_address         = (known after apply)
      [33m~[0m[0m locked               = false -> (known after apply)
      [33m~[0m[0m memory               = 16384 -> (known after apply)
        name                 = "forest-snapshot"
      [33m~[0m[0m price_hourly         = 0.125 -> (known after apply)
      [33m~[0m[0m price_monthly        = 84 -> (known after apply)
      [33m~[0m[0m private_networking   = true -> (known after apply)
      [33m~[0m[0m status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      [33m~[0m[0m urn                  = "do:droplet:377968175" -> (known after apply)
      [33m~[0m[0m user_data            = "1dc52e474cf2babb0a34e74c2e4b3e0d2eaa9046" [33m->[0m[0m "a9a34729ce78a72a5fce906a04c7ab61543b374d" [31m# forces replacement[0m[0m
      [33m~[0m[0m vcpus                = 4 -> (known after apply)
      [33m~[0m[0m volume_ids           = [] -> (known after apply)
      [33m~[0m[0m vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # module.daily_snapshot.digitalocean_firewall.forest-firewall[0m will be updated in-place
[0m  [33m~[0m[0m resource "digitalocean_firewall" "forest-firewall" {
      [33m~[0m[0m droplet_ids     = [
          [31m-[0m[0m 377968175,
        ] -> (known after apply)
        id              = "dfacde1e-cd3f-4b42-8265-b08fa2766567"
        name            = "forest-snapshot"
        tags            = []
        [90m# (3 unchanged attributes hidden)[0m[0m

        [90m# (6 unchanged blocks hidden)[0m[0m
    }

[1m  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project[0m will be updated in-place
[0m  [33m~[0m[0m resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      [33m~[0m[0m resources = [
          [31m-[0m[0m "do:droplet:377968175",
        ] -> (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 2 to change, 1 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m ip = [
      [31m-[0m[0m [
          [31m-[0m[0m "138.197.178.108",
        ],
      [32m+[0m[0m [
          [32m+[0m[0m (known after apply),
        ],
    ]
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>